USE campus_lost_and_found;

-- 1. เพิ่มข้อมูลหมวดหมู่ของสิ่งของ (Category)
INSERT INTO Category (Category_name) VALUES
  ('บัตรนักศึกษา / บัตรประจำตัวบุคลากร'),
  ('กระเป๋าเงิน / กระเป๋าสตางค์'),
  ('บัตรประชาชน / ใบขับขี่ / บัตรเดบิต-เครดิต'),
  ('หูฟังไร้สาย (AirPods / Earbuds) และเคสหูฟัง'),
  ('ปากกาแท็บเล็ต (Apple Pencil / S Pen)'),
  ('สายชาร์จ / หัวชาร์จ / พาวเวอร์แบงก์'),
  ('สมาร์ทโฟน / แท็บเล็ต / โน๊ตบุ๊ค'),
  ('แฟลชไดรฟ์ / External Hard Drive'),
  ('กุญแจห้องพัก / กุญแจหอพัก / คีย์การ์ดเข้าอาคาร'),
  ('กุญแจรถยนต์ / กุญแจรถจักรยานยนต์'),
  ('กุญแจล็อกเกอร์'),
  ('แว่นสายตา / แว่นกันแดด'),
  ('เสื้อกันหนาว / เสื้อคลุม / เสื้อช็อป / เสื้อกาวน์'),
  ('ร่ม'),
  ('นาฬิกาข้อมือ / สมาร์ทวอทช์'),
  ('หมวก / เครื่องประดับ (แหวน, สร้อย)'),
  ('แก้วน้ำเก็บความเย็น / กระติกน้ำ'),
  ('เครื่องสำอาง / ลิปมัน / ยาดม / กระเป๋าเครื่องสำอาง'),
  ('ยารอบตัว / ตลับยา'),
  ('เครื่องคิดเลขวิทยาศาสตร์'),
  ('กระเป๋าดินสอ / ปากการาคาแพง'),
  ('สมุดโน้ต / หนังสือเรียน / เอกสารชีทเรียน'),
  ('ถุงผ้า / กระเป๋าผ้าทอ'),
  ('กระเป๋าเป้ / กระเป๋าเอกสาร'),
  ('กระเป๋ากีฬา / ชุดออกกำลังกาย'),
  ('อื่นๆ');

-- 2. เพิ่มข้อมูลสถานที่ (Location)
INSERT INTO Location (Location_name) VALUES
  ('อาคารจุฬาภรณวลัยลักษณ์ 1'),
  ('อาคารจุฬาภรณวลัยลักษณ์ 2'),
  ('อาคารพระจอมเกล้า'),
  ('อาคารคณะวิทยาศาสตร์'),
  ('หอประชุมจุฬาภรณวลัยลักษณ์'),
  ('โรงอาหาร'),
  ('Co-working : สโมนักศึกษา'),
  ('Co-working : อาคารจุฬาภรณวลัยลักษณ์ 2'),
  ('Co-working : Making Space'),
  ('ศูนย์เครื่องมือวิทยาศาสตร์'),
  ('อื่นๆ');

-- 3. เพิ่มบัญชีเจ้าหน้าที่สำหรับทดสอบระบบ (Admin)
INSERT INTO Admin (Admin_email, Admin_password) VALUES
  ('admin@campus.ac.th', 'admin1234');

-- 4. เพิ่มบัญชีผู้ใช้งานสำหรับทดสอบระบบ (User)
INSERT INTO User (FName, LName, Student_ID, Email, Password) VALUES
  ('สมหญิง', 'ใจดี', 67051234, 'somying@campus.ac.th','Somying*1234');